098_Мастер_Ра_разработка/src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <registerRecords>InformationRegister.СтоимостиЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоЗаказам</registerRecords>
  <registerRecords>InformationRegister.Заказы</registerRecords>
  <attributes>
    <name>Агент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезКонтроляПроизводства</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВертикальИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вечер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>EnumRef.ВидыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыборкаПлотернаяРезка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтальИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяМонтажа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяСборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопТребованиеКЗаказу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопТребованиеКУпаковке</name>
    <type>
      <types>EnumRef.ДопТребованияКУпаковке</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНаряд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСвязанныйЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияВСчете</name>
    <type>
      <types>CatalogRef.Продукция</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоЗаВесьЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСторон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляВодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКомДира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МаржаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатериалОсновы</name>
    <type>
      <types>CatalogRef.МатериалОсновы</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МонтажкаПлотернаяРезка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МонтажникиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НадписьНаУпаковке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НулеваяЦена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяПлощадьИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееКоличествоПогонныхМетров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Переделка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатнаяМашина</name>
    <type>
      <types>CatalogRef.ПечатныеМашины</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьВсё</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоляПриПечати</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПеределки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешениеПечати</name>
    <type>
      <types>EnumRef.РазрешенияПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>РасположениеПолей</name>
    <type>
      <types>CatalogRef.РасположениеПолей</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйЗаказ</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздатьНаряд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаТарифа</name>
    <type>
      <types>EnumRef.СпособыРасчетаТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИзготовленияЗаказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>DocumentRef.Счет</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехническиеХарактеристики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тираж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветопробаКЗаказу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаКвМетр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаЭкземпляр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>РКО</name>
      <type>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ПрочиеЗатраты</types>
      </type>
    </attributes>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыОсновы</name>
    <attributes>
      <name>МатериалОсновы</name>
      <type>
        <types>CatalogRef.МатериалОсновы</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостпечатныеРаботы</name>
    <attributes>
      <name>ВидРаботПоПериметру</name>
      <type>
        <types>EnumRef.ВидРаботПоПериметру</types>
      </type>
    </attributes>
    <attributes>
      <name>РасстояниеМеждуЛюверсами</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрЛюверсов</name>
      <type>
        <types>EnumRef.ДиаметрЛюверсов</types>
      </type>
    </attributes>
    <attributes>
      <name>Размещение</name>
      <type>
        <types>CatalogRef.РасположениеПолей</types>
      </type>
    </attributes>
    <attributes>
      <name>ГлубинаКарманов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Карманы</name>
      <type>
        <types>EnumRef.Карманы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеДокументы</name>
    <attributes>
      <name>Докум</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
    <attributes>
      <name>СвязаннаяЗаявка</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Стоимости</name>
    <attributes>
      <name>Работы</name>
      <type>
        <types>EnumRef.РаботыСтоимости</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДляКлиента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Монтажники</name>
    <attributes>
      <name>Монтажник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Дизайнеры</name>
    <attributes>
      <name>Дизайнер</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

098_Мастер_Ра_разработка/src/InformationRegisters/ЗначениеНомераГруппы/ЗначениеНомераГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначениеНомераГруппы</name>
  <dimensions>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Передел</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

098_Мастер_Ра_разработка/src/Enums/Статусы/Статусы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Статусы</name>
  <enumValues>
    <name>Вработе</name>
  </enumValues>
  <enumValues>
    <name>Готов</name>
  </enumValues>
  <enumValues>
    <name>ДебиторкаПросрочена</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ЗаполненаСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>НаСогласованииЗаказчика</name>
  </enumValues>
  <enumValues>
    <name>НетДокументов</name>
  </enumValues>
  <enumValues>
    <name>ПеределкаЗаказа</name>
  </enumValues>
  <enumValues>
    <name>Проверен</name>
  </enumValues>
</mdclass:Enum>

098_Мастер_Ра_разработка/src/Documents/Заявка/Forms/ФормаДокументаДляЦеха/Module.bsl
// @strict-types


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда 		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 
			//Объект.ВидРабот = Параметры.ЗначениеКопирования.ВидРабот;
		Иначе 	
			Если Параметры.ВидыРабот = "СобственнаяПечать" Тогда 
				Объект.ВидРабот = Перечисления.ВидыРабот.СобственнаяПечать;
			ИначеЕсли Параметры.ВидыРабот = "Изготовление" Тогда 
				Если Параметры.ПодВидыРабот = "Сборка" Тогда  
					Объект.ВидРабот  = Перечисления.ВидыРабот.Сборка;
				ИначеЕсли Параметры.ПодВидыРабот = "ПлотернаяРезка" Тогда                                  
					Объект.ВидРабот  = Перечисления.ВидыРабот.ПлотернаяРезка;
				ИначеЕсли Параметры.ПодВидыРабот = "Ламинация" Тогда  
					Объект.ВидРабот  = Перечисления.ВидыРабот.Ламинация;
				ИначеЕсли Параметры.ПодВидыРабот = "Окраска" Тогда  
					Объект.ВидРабот  = Перечисления.ВидыРабот.Окраска;	
				ИначеЕсли Параметры.ПодВидыРабот = "Резка" Тогда  
					Объект.ВидРабот  = Перечисления.ВидыРабот.Резка;
				КонецЕсли;
			ИначеЕсли Параметры.ВидыРабот = "Монтаж" Тогда  
				Объект.ВидРабот  = Перечисления.ВидыРабот.Монтаж;
			ИначеЕсли Параметры.ВидыРабот = "Доставка" Тогда  
				Объект.ВидРабот  = Перечисления.ВидыРабот.Доставка;		
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ГруппаПлотернаяРезка.Видимость 		= Ложь;
	Элементы.ВидПродукции.Видимость 				= Ложь;
	Элементы.ПечатнаяМашина.Видимость 				= Ложь;
	Элементы.РазрешениеПечати.Видимость 			= Ложь;
	Элементы.ПоляПриПечати.Видимость 				= Ложь;
	Элементы.РасположениеПолей.Видимость			= Ложь;
		
	Если Объект.ВидРабот = Перечисления.ВидыРабот.СобственнаяПечатьНестандартныйРазмер Тогда 
		Элементы.ВидПродукции.Видимость 				= Истина;
		Элементы.ПечатнаяМашина.Видимость 				= Истина;
		Элементы.РазрешениеПечати.Видимость 			= Истина;
		Элементы.ПоляПриПечати.Видимость 				= Истина;
		Элементы.РасположениеПолей.Видимость			= Истина;
		
		//Изм. с переносом элемента
		Элементы.СтраницаПостпечатныеРаботы.Видимость 	= Истина;
		Элементы.ПостпечатныеРаботы.Видимость 			= Истина;
		
		Элементы.ДатаИВремяМонтажа.Видимость            = Ложь;
		Элементы.ДатаИВремяСборки.Видимость 			= Ложь;
	ИначеЕсли Объект.ВидРабот =  Перечисления.ВидыРабот.Сборка Тогда 
		Элементы.ДатаИВремяМонтажа.Видимость            = Ложь;
		Элементы.ДатаИВремяДоставки.Видимость 			= Ложь;
		//Элементы.СтраницаПроизводство.Видимость 		= Ложь; 160622
		Элементы.ДатаИВремяСборки.Видимость 			= Истина;
	ИначеЕсли Объект.ВидРабот = Перечисления.ВидыРабот.ПлотернаяРезка Тогда 
		Элементы.ГруппаПлотернаяРезка.Видимость 		= Истина;
		Если Параметры.Ключ.Пустая() Тогда
			Объект.ВыборкаПлотернаяРезка = Параметры.ВыборкаПлотернаяРезка;
			Объект.МонтажкаПлотернаяРезка= Параметры.МонтажкаПлотернаяРезка;
		КонецЕсли;
		Элементы.ЦветопробаКЗаказу.Видимость 	= Ложь;
		Элементы.ДатаИВремяСборки.Видимость 	= Ложь;
		Элементы.ДатаИВремяДоставки.Видимость 	= Истина;
		Элементы.ДатаИВремяМонтажа.Видимость    = Ложь;
	ИначеЕсли Объект.ВидРабот = Перечисления.ВидыРабот.Ламинация 
		или Объект.ВидРабот = Перечисления.ВидыРабот.Окраска
		или Объект.ВидРабот = Перечисления.ВидыРабот.Доставка
		или Объект.ВидРабот = Перечисления.ВидыРабот.Резка Тогда 
		Элементы.ГруппаПлотернаяРезка.Видимость = Ложь;
		Элементы.ЦветопробаКЗаказу.Видимость 	= Ложь;
		Элементы.ДатаИВремяСборки.Видимость 	= Ложь;
		Элементы.ДатаИВремяДоставки.Видимость 	= Истина;
		Элементы.ДатаИВремяМонтажа.Видимость    = Ложь;
	ИначеЕсли Объект.ВидРабот = Перечисления.ВидыРабот.Монтаж Тогда 
		Элементы.ГруппаПлотернаяРезка.Видимость = Ложь;
		Элементы.ЦветопробаКЗаказу.Видимость 	= Ложь;
		Элементы.ДатаИВремяСборки.Видимость 	= Ложь;
		Элементы.ДатаИВремяДоставки.Видимость 	= Ложь;
		Элементы.ДатаИВремяМонтажа.Видимость    = Истина;	
	КонецЕсли;
	
	ТелКонтактногоЛица = Объект.КонтактноеЛицо.Телефон;
		
	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда 
		Объект.Статус 		= Перечисления.Статусы.Вработе;
		Модифицированность 	= Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучениеСписков.ВидовПродукции(Объект.ВидРабот);
КонецПроцедуры

&НаСервере
Процедура ПечатнаяМашинаПриИзмененииНаСервере()
	Если Объект.ПечатнаяМашина.ВидМашины = Перечисления.ВидыПечатныхМашин.Интерьерная Тогда 
		Элементы.РазрешениеПечати.Видимость = Ложь;
	Иначе 
		Элементы.РазрешениеПечати.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПечатнаяМашинаПриИзменении(Элемент)
	ПечатнаяМашинаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВертикальИзображенияПриИзменении(Элемент)
	РасчитатьПлощадь();
КонецПроцедуры

Процедура РасчитатьПлощадь()
	Объект.ПлощадьИзображения 	= Объект.ВертикальИзображения*Объект.ГоризонтальИзображения;
	РасчитатьОбщуюПлощадьИзображения();
КонецПроцедуры

&НаКлиенте
Процедура ГоризонтальИзображенияПриИзменении(Элемент)
	РасчитатьПлощадь();
КонецПроцедуры

&НаСервере
Процедура  РасчитатьОбщуюПлощадьИзображения()
	 Объект.ОбщаяПлощадьИзображения = Объект.ПлощадьИзображения*Объект.Тираж
	 	//[+]280822
	*?(Объект.КоличествоСторон=0,1,Объект.КоличествоСторон);
	//[+]280822
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Параметры.Ключ.Пустая() и ЗначениеЗаполнено(ТекущийОбъект.Номер)=Ложь тогда 
		ТекущийОбъект.Номер = ОбщегоНазначенияВызовСервера.СформироватьНомерЗаявки(Неопределено,Неопределено);	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСменеСтраницыЗатратыНаСервере()
	
	Затраты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйКассовыйОдерЗаказы.Ссылка КАК РКО,
		|	СУММА(РасходныйКассовыйОдерЗаказы.Сумма) КАК Сумма,
		|	РасходныйКассовыйОдерЗаказы.Ссылка.НаименованиеРасхода КАК НаименованиеРасхода
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер.Заказы КАК РасходныйКассовыйОдерЗаказы
		|ГДЕ
		|	РасходныйКассовыйОдерЗаказы.Заявка = &Заявка
		|	И РасходныйКассовыйОдерЗаказы.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходныйКассовыйОдерЗаказы.Ссылка,
		|	РасходныйКассовыйОдерЗаказы.Ссылка.НаименованиеРасхода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрочиеЗатратыЗаказы.Ссылка,
		|	СУММА(ПрочиеЗатратыЗаказы.Сумма),
		|	ПрочиеЗатратыЗаказы.Ссылка.НаименованиеРасхода
		|ИЗ
		|	Документ.ПрочиеЗатраты.Заказы КАК ПрочиеЗатратыЗаказы
		|ГДЕ
		|	ПрочиеЗатратыЗаказы.Заявка = &Заявка
		|	И ПрочиеЗатратыЗаказы.Ссылка.Проведен
		|	И ПрочиеЗатратыЗаказы.Ссылка.ДокументОплаты = ЗНАЧЕНИЕ(Документ.РасходныйКассовыйОрдер.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрочиеЗатратыЗаказы.Ссылка,
		|	ПрочиеЗатратыЗаказы.Ссылка.НаименованиеРасхода";
	
	Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		новСтрока = Затраты.Добавить();
		ЗаполнитьЗначенияСвойств(новСтрока,Выборка);
	КонецЦикла;	
	
	Объект.МаржаЗаказа = Объект.Стоимости.Итог("ЦенаДляКлиента")-Затраты.Итог("Сумма");
	
КонецПроцедуры

&НаСервере
Процедура ПриСменеСтраницыСвязанныеЗаявкиНаСервере()
	
	СвязанныеДокументы.Очистить();	
	//найдем связанную заявку для звязаного заказа
	Если ЗначениеЗаполнено(Объект.СвязанныйЗаказ) Тогда 
		НовСтрока = СвязанныеДокументы.Добавить();
		//Строка связанные с этой заявкой
		НовСтрока.СвязаннаяЗаявка 	= Объект.СвязанныйЗаказ;
		
		поикЗаявка = ПолучитьСвязаннуюЗаявку(Объект.СвязанныйЗаказ);
		Пока поикЗаявка<>Документы.Заявка.ПустаяСсылка() Цикл
			НовСтрока = СвязанныеДокументы.Добавить();
			НовСтрока.СвязаннаяЗаявка 	= поикЗаявка;			
			поикЗаявка = ПолучитьСвязаннуюЗаявку(поикЗаявка);			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСвязаннуюЗаявку(Заявка)
	
	СвязаннаяЗаявка = Документы.Заявка.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Заявка.СвязанныйЗаказ КАК СвязанныйЗаказ
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	Заявка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий(); 
		СвязаннаяЗаявка = ВыборкаДетальныеЗаписи.СвязанныйЗаказ;
	КонецЕсли;

	Возврат СвязаннаяЗаявка;
	  
КонецФункции	

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "СтраницаЗатраты" Тогда 
		ПриСменеСтраницыЗатратыНаСервере();
		Элементы.тВсегоЗатрат.Заголовок = "Всего затрат: "+Затраты.Итог("Сумма");
	иначеЕсли ТекущаяСтраница.Имя = "СтраницаСвязанныеЗаявки" Тогда
		ПриСменеСтраницыСвязанныеЗаявкиНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЕстьСвязанныйЗаказПриИзменении(Элемент)
	Если Объект.ЕстьСвязанныйЗаказ Тогда 
		ОткрытьФорму("Документ.Заявка.ФормаВыбора",,,,,,Новый ОписаниеОповещения("ЕстьСвязанныйЗаказПриИзмененииПослеВыбора", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе 
		Объект.СвязанныйЗаказ = Неопределено;		
	КонецЕсли;	
	Элементы.СвязанныйЗаказ.Видимость = Объект.ЕстьСвязанныйЗаказ;
КонецПроцедуры

&НаКлиенте
Процедура ЕстьСвязанныйЗаказПриИзмененииПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Объект.ЕстьСвязанныйЗаказ = Ложь;
	иначе		
		Если Результат = Объект.Ссылка Тогда 	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Выбран текущий документ!
			|Выберите другой!";
			Сообщение.Сообщить();
			Объект.ЕстьСвязанныйЗаказ = Ложь;
		Иначе 
			Объект.СвязанныйЗаказ = Результат;	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	массив = ОбщегоНазначенияВызовСервера.РазложитьСтрокуВМассивПодстрок(Объект.Номер,"-");
	записьРег = РегистрыСведений.ЗначениеНомераГруппы.СоздатьМенеджерЗаписи();
	записьРег.Префикс 	= массив.получить(0);
	записьРег.Номер	 	= массив.получить(1);
	записьРег.Группа 	= массив.получить(2);
	Попытка
		записьРег.Передел  = массив.получить(3);
	Исключение
		записьРег.Передел  = 0;
	КонецПопытки;
	записьРег.Записать();
		
КонецПроцедуры

&НаКлиенте
Процедура КоличествоСторонПриИзменении(Элемент)
	РасчитатьОбщуюПлощадьИзображения();
КонецПроцедуры

&НаКлиенте
Процедура ТиражПриИзменении(Элемент)
	РасчитатьОбщуюПлощадьИзображения();
КонецПроцедуры

&НаКлиенте
Процедура ПлощадьИзображенияПриИзменении(Элемент)
	РасчитатьОбщуюПлощадьИзображения();
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиЦенаДляКлиентаПриИзменении(Элемент)
	Если Не Объект.НулеваяЦена Тогда 
		Объект.ИтогоЗаВесьЗаказ = Объект.Стоимости.Итог("ЦенаДляКлиента");
		РасчитатьЗаМетрКвИзображения();
		РасчитатьЗаЭкземплярИзображения();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура  РасчитатьЗаМетрКвИзображения()	
	Если Объект.ОбщаяПлощадьИзображения>0 Тогда 
		Объект.ЦенаЗаКвМетр = Объект.ИтогоЗаВесьЗаказ/Объект.ОбщаяПлощадьИзображения;
	Иначе 
		Объект.ЦенаЗаКвМетр = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура  РасчитатьЗаЭкземплярИзображения()	
	Если Объект.ОбщаяПлощадьИзображения>0 Тогда 
		Объект.ЦенаЗаЭкземпляр = Объект.ИтогоЗаВесьЗаказ/Объект.Тираж;
	Иначе 
		Объект.ЦенаЗаЭкземпляр = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИтогоЗаВесьЗаказПриИзменении(Элемент)
	РасчитатьЗаМетрКвИзображения();
	РасчитатьЗаЭкземплярИзображения();
КонецПроцедуры

&НаКлиенте
Процедура СтоимостиРаботыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучениеСписков.ВидовСтоимости(Объект.ВидРабот);
	
	Если Строка(Объект.ВидРабот)="Плотерная резка" Тогда 
		Если Объект.ВыборкаПлотернаяРезка = Ложь Тогда 
			Структура = Новый Структура;
			Структура.Вставить("СписокЗначений",ДанныеВыбора);
			Структура.Вставить("Вид","Выборка");
			инд = ПолучитьИндексДанныхВыбора(Структура);
			Если инд<>Неопределено Тогда 
				ДанныеВыбора.Удалить(инд);
			КонецЕсли;
		КонецЕсли;
		
		Если Объект.МонтажкаПлотернаяРезка = Ложь Тогда 
			Структура = Новый Структура;
			Структура.Вставить("СписокЗначений",ДанныеВыбора);
			Структура.Вставить("Вид","Монтажка");
			инд = ПолучитьИндексДанныхВыбора(Структура);
			Если инд<>Неопределено Тогда 
				ДанныеВыбора.Удалить(инд);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьИндексДанныхВыбора(Структура)
	
	инд = Неопределено;
	эл 	= Структура.СписокЗначений.НайтиПоЗначению(Перечисления.РаботыСтоимости[Структура.Вид]);
	инд = Структура.СписокЗначений.Индекс(эл);	
	
	Возврат инд;
	
КонецФункции	

&НаКлиенте
Процедура ФайлыИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФайла.Фильтр = "Все файлы (*.*)|*.*";
	Если ДиалогФайла.Выбрать() Тогда
		Элементы.Файлы.ТекущиеДанные.ИмяФайла = СтрЗаменить(ДиалогФайла.ПолноеИмяФайла, ДиалогФайла.Каталог+"\", "");
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//текСтрока = Затраты.Получить(ВыбраннаяСтрока); ошибку вызывает
	текСтрока = Элементы.Затраты.ТекущиеДанные;
	Парам = новый Структура;
	Парам.вставить("Ключ",текСтрока.РКО);
	Если ТипЗнч(текСтрока.РКО) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда 
		ОткрытьФорму("Документ.РасходныйКассовыйОрдер.ФормаОбъекта",парам);
	ИначеЕсли ТипЗнч(текСтрока.РКО) = Тип("ДокументСсылка.ПрочиеЗатраты") Тогда
		ОткрытьФорму("Документ.ПрочиеЗатраты.ФормаОбъекта",парам);
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ФайлыИмяФайлаОткрытие(Элемент, СтандартнаяОбработка)
	ЗапуститьПриложение(Элементы.Файлы.ТекущиеДанные.ИмяФайла);
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоПриИзменении(Элемент)
	Попытка
		ТелКонтактногоЛица = Объект.КонтактноеЛицо.Телефон;
	Исключение
		ТелКонтактногоЛица = "";
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыПриИзменении(Элемент)
	Если Строка(Объект.ФормаОплаты)="По сверке" Тогда 
		Элементы.Период.Видимость = Истина;
	Иначе 
		Элементы.Период.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучениеСписков.АдресовДоставкиПоКонтрагенту(Объект.Контрагент);
КонецПроцедуры
